<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GitHub Desktop and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peterthegrey.munki.GitHubDesktop-Development</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>GitHub Desktop</string>
		<key>DESTINATION_PATH</key>
        <string>/Applications/Development</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Desktop app made by GitHub for seamless contribution to git projects.</string>
			<key>developer</key>
			<string>GitHub, Inc.</string>
			<key>display_name</key>
			<string>GitHub Desktop</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>items_to_copy</key>
	      <array>
		    <dict>
			    <key>destination_path</key>
			    <string>%DESTINATION_PATH%</string>
			    <key>source_item</key>
			    <string>GitHub Desktop.app</string>
		    </dict>
	    </array>
			<key>postinstall_script</key>
			<string>#!/bin/bash

DEST_DIR="/usr/local/bin"

if [[ ! -d "$DEST_DIR" ]]; then
    mkdir -p "$DEST_DIR"
fi

ln -s "/Applications/Development/GitHub Desktop.app/Contents/Resources/app/static/github.sh" "$DEST_DIR/github"

exit 0
</string>
			<key>preinstall_script</key>
			<string>#!/bin/bash

DEST_DIR="/usr/local/bin"

# Remove old symbolic links associated with pre-Electron version of GitHub Desktop.
if [[ -L "$DEST_DIR/git-lfs" ]]; then
    rm -f "$DEST_DIR/git-lfs"
fi

exit 0
</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.2</string>
	<key>ParentRecipe</key>
	<string>com.github.peterthegrey.download.GitHubDesktop-Development</string>
	<key>Process</key>
	<array>
		
		      <dict>
        <key>Arguments</key>
        <dict>
          <key>faux_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>installs_item_paths</key>
          <array>
            <string>%DESTINATION_PATH%/GitHub Desktop.app</string>
          </array>
        </dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
      </dict>
      <dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%%DESTINATION_PATH%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>

